<template>
  <div class="about_container">
    <SingleCarousel :autoScroll="true" :scrollInterval="5000" :singleBanner="true" :path="'about_carusels'"/>
    <section class="paragraph">
      <h2>О проекте</h2>
      <span class="content">
        <p>
          <b>НАЛЕТАЙ.РФ</b> - первый в России маркетплейс на рынке беспилотной авиации, объединяющий производителей, дистрибьюторов, эксплуатантов, конструкторов и заказчиков 
          на одной площадке. Создан ключевым игроком рынка беспилотной авиации в стране - АО «Государственная транспортная лизинговая компания».
          Мы видим нашу миссию в создании полноценной экосистемы, охватывающей все потребности основных участников рынка беспилотной авиации в России, 
          включая продажу беспилотных авиационных систем (БАС) и предоставление сопутствующих сервисов и услуг, обеспечение обратной связи от эксплуатантов к производителям, 
          сбор и систематизацию аналитических данных, а также организацию доступа к мерам господдержки. В настоящее время маркетплейс работает в режиме бета-версии.
        </p>
        <p>
          Регистрация на платформе открыта пока только для юридических лиц (покупателей и продавцов), для физических лиц – станет доступна позднее. 
          Функционал платформы и количество доступных сервисов будет постоянно увеличиваться. Сейчас на НАЛЕТАЙ.РФ доступны для заказа все представленные в каталоге 
          БАС с описанием их сферы применения и всех технических характеристик, а также услуги. Удобная система навигации и возможность настроить фильтры для поиска помогут 
          быстро найти интересующие модели. После выбора конкретного товара или услуги пользователю будет отправлено коммерческое предложение, 
          а также откроется опция по оформлению БАС в лизинг. Разработаны функциональные рабочие пространства (личные кабинеты) для коммуникаций и подготовки сделок, 
          а также сервис приема заявок на участие в программах с государственной поддержкой (Государственный гражданский заказ и  Льготный лизинг).
        </p>
      </span>
    </section>
  </div>
</template>

<script>
import SingleCarousel from '@/components/Carousel.vue';

export default {
  components: {
        SingleCarousel,
  },
  methods: {
    openContactForm() {
      window.contactModal.open();
    },
  },
};
</script>

<style scoped>
.about_container {
  display: flex;
  flex-direction: column;
  height: 100%;
  width: 100%;
  max-width: 1280px;
  gap: 80px;
  margin-bottom: 200px;
  padding: 0px 20px;
  box-sizing: border-box;
}

.paragraph h2{
  font-size: 32px;
  font-weight: 500;
}

.paragraph{
  display: flex;
  flex-flow: column;
  gap:15px;
}

.content {
  display: flex;
  flex-flow: column;
  gap: 25px;
}

.content p{
  font-size: 18px;
}

.content b{
  font-weight: 600;
}
</style>